<a href="https://colab.research.google.com/github/MarkVoitov/DS_ABB/blob/main/%D0%A3%D0%BF%D1%80%D0%B0%D0%B6%D0%BD%D0%B5%D0%BD%D0%B8%D1%8F_pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Pandas

**Импорт pandas**

In [1]:
import pandas as pd

**Прочитайте файл bank.csv, который вы положите в папку с этим ноутбуком. Обратите особое внимание на то, где находится файл .csv! **

In [2]:
a = pd.read_csv("bank.csv")
a

      age            job  marital  education  ... pdays  previous poutcome   y
0      30     unemployed  married    primary  ...    -1         0  unknown  no
1      33       services  married  secondary  ...   339         4  failure  no
2      35     management   single   tertiary  ...   330         1  failure  no
3      30     management  married   tertiary  ...    -1         0  unknown  no
4      59    blue-collar  married  secondary  ...    -1         0  unknown  no
...   ...            ...      ...        ...  ...   ...       ...      ...  ..
4516   33       services  married  secondary  ...    -1         0  unknown  no
4517   57  self-employed  married   tertiary  ...    -1         0  unknown  no
4518   57     technician  married  secondary  ...    -1         0  unknown  no
4519   28    blue-collar  married  secondary  ...   211         3    other  no
4520   44   entrepreneur   single   tertiary  ...   249         7    other  no

[4521 rows x 17 columns]

**Показать первые 5 строк набора данных**

In [3]:
a.head()

   age          job  marital  education  ... pdays  previous poutcome   y
0   30   unemployed  married    primary  ...    -1         0  unknown  no
1   33     services  married  secondary  ...   339         4  failure  no
2   35   management   single   tertiary  ...   330         1  failure  no
3   30   management  married   tertiary  ...    -1         0  unknown  no
4   59  blue-collar  married  secondary  ...    -1         0  unknown  no

[5 rows x 17 columns]

**Каков средний (средний) возраст людей в наборе данных**

In [4]:
a['age'].mean()

41.17009511170095

41.17009511170095

**Каково семейное положение самого молодого человека в наборе данных?**

In [5]:
a['marital'][a['age'].argmin()]

'single'

'single'

**Сколько существует уникальных категорий вакансий?**

In [6]:
a['job'].value_counts().count()

12

12

**Сколько человек в каждой категории работы? (Взгляните на ожидаемый результат)**

In [7]:
a['job'].value_counts()

management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: job, dtype: int64

management       969
blue-collar      946
technician       768
admin.           478
services         417
retired          230
self-employed    183
entrepreneur     168
unemployed       128
housemaid        112
student           84
unknown           38
Name: job, dtype: int64

**Какой процент людей в наборе данных был женат? **

In [8]:
a[a['marital'] == 'married'].shape[0] / a.shape[0]

0.6186684361866843

61.86684361866843

**В датасете есть столбец с именем «default». Используйте метод pandas .map () для создания нового столбца под названием «default code», который содержит 0, если не было значения по умолчанию, или 1, если было значение по умолчанию. Затем покажите начало набора данных с этим новым столбцом.**

In [9]:
a['default code'] = a['default'].map({'no': 0, 'yes':1})
a.head()

   age          job  marital  education  ... previous  poutcome   y default code
0   30   unemployed  married    primary  ...        0   unknown  no            0
1   33     services  married  secondary  ...        4   failure  no            0
2   35   management   single   tertiary  ...        1   failure  no            0
3   30   management  married   tertiary  ...        0   unknown  no            0
4   59  blue-collar  married  secondary  ...        0   unknown  no            0

[5 rows x 18 columns]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0

**Используя метод pandas .apply (), создайте новый столбец с именем «код брака». Этот столбец будет содержать только сокращенный код первой буквы возможного семейного положения. (Например, «m» для «замужних», «s» для «холостых» и т. Д. Посмотрите, можете ли вы сделать это с помощью лямбда-выражения**

In [10]:
a['marital code'] = a['marital'].apply(lambda x: x[0])
a

      age            job  marital  ...   y default code  marital code
0      30     unemployed  married  ...  no            0             m
1      33       services  married  ...  no            0             m
2      35     management   single  ...  no            0             s
3      30     management  married  ...  no            0             m
4      59    blue-collar  married  ...  no            0             m
...   ...            ...      ...  ...  ..          ...           ...
4516   33       services  married  ...  no            0             m
4517   57  self-employed  married  ...  no            1             m
4518   57     technician  married  ...  no            0             m
4519   28    blue-collar  married  ...  no            0             m
4520   44   entrepreneur   single  ...  no            0             s

[4521 rows x 19 columns]

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y,default code,marital code
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no,0,m
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no,0,m
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no,0,s
3,30,management,married,tertiary,no,1476,yes,yes,unknown,3,jun,199,4,-1,0,unknown,no,0,m
4,59,blue-collar,married,secondary,no,0,yes,no,unknown,5,may,226,1,-1,0,unknown,no,0,m

**Найти самое большое значение duration**

In [11]:
a['duration'].max()

3025

3025

**Какой уровень образования наиболее часто встречается среди безработных?**

In [12]:
a[a['job'] == 'unemployed']['education'].value_counts()

secondary    68
tertiary     32
primary      26
unknown       2
Name: education, dtype: int64

secondary    68
tertiary     32
primary      26
unknown       2
Name: education, dtype: int64

**Каков средний (средний) возраст безработного?**

In [13]:
a[a['job'] == 'unemployed']['age'].mean()

40.90625

40.90625